ETL/Documents/ЗаявкаНаДобавлениеСправочника.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<Name>ЗаявкаНаДобавлениеСправочника</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСправочника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Группа</Name>
					<Type>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭлектронныйАдрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактныйТелефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭлементСправочника</Name>
					<Type>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЗаявки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

ETL/Catalogs/Базы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>Базы</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипБазы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыБаз</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПринятогоСообщения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерОбработанногоСообщения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПринятияСообщения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольZip</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отключена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Локальная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаппингВЦентре</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХешКонфигурации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Расписание</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДеньНедели</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ДниНедели</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Время</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Организации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ETL/Catalogs/ТоварыИУслуги.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>ТоварыИУслуги</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КодСправочника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокБизнесНаправлений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеИспользуется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>БизнесНаправления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>БизнесНаправление</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.БизнесНаправления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ETL/WebServices/EtalonRefSyncEx/Ext/Module.bsl
Функция GetReference(Reference,Base)
	  НайденнаяОрг = Справочники.Организации.ПустаяСсылка();
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	БазыОрганизации.Ссылка КАК Ссылка,
		               |	БазыОрганизации.Организация КАК Организация
		               |ИЗ
		               |	Справочник.Базы.Организации КАК БазыОрганизации
		               |ГДЕ
		               |	БазыОрганизации.Ссылка.Наименование = &ИмяБазы";
		
	Запрос.УстановитьПараметр("ИмяБазы",Base);
	РезОрг = запрос.Выполнить().Выбрать();
	если РезОрг.Следующий() Тогда
		НайденнаяОрг = РезОрг.Организация;
	КонецЕсли;	
	
	
	если Reference = "ТоварыИУслуги" Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			               |	References.Ссылка КАК Ссылка,
			               |	References.Код КАК Code,
			               |	References.Наименование КАК Name,
			               |	ЕСТЬNULL(References.Родитель.Код, """") КАК ParentCode,
			               |	ЕСТЬNULL(References.Родитель.Наименование, """") КАК ParentName,
			               |	References.Родитель КАК Parent,
			               |	References.ЭтоГруппа КАК IsParent
			               |ИЗ
			               |	Справочник.ТоварыИУслуги.БизнесНаправления КАК ТоварыИУслугиБизнесНаправления
			               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТоварыИУслуги КАК References
			               |		ПО ТоварыИУслугиБизнесНаправления.Ссылка = References.Ссылка
			               |ГДЕ
			               |	ТоварыИУслугиБизнесНаправления.БизнесНаправление = &БизнесНаправление
			               |
			               |УПОРЯДОЧИТЬ ПО
			               |	Code,
			               |	IsParent ИЕРАРХИЯ";
			Запрос.УстановитьПараметр("БизнесНаправление",НайденнаяОрг.БизнесНаправление);
	Иначе	
		
		Мета = Метаданные.Справочники[Reference];
		Если Мета.ВидИерархии = Метаданные.СвойстваОбъектов.ВидИерархии.ИерархияГруппИЭлементов Тогда	
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			|	References.Ссылка КАК Ссылка,
			|	References.Код КАК Code,
			|	References.Наименование КАК Name,
			|	ЕСТЬNULL(References.Родитель.Код, """") КАК ParentCode,
			|	ЕСТЬNULL(References.Родитель.Наименование, """") КАК ParentName,
			|	References.Родитель КАК Parent,
			|	References.ЭтоГруппа КАК IsParent
			|ИЗ
			|	Справочник."+Reference+" КАК References
			|
			|УПОРЯДОЧИТЬ ПО
			|	Code,
			|IsParent ИЕРАРХИЯ";
		Иначе
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			|	References.Ссылка КАК Ссылка,
			|	References.Код КАК Code,
			|	References.Наименование КАК Name,
			|	ЕСТЬNULL(References.Родитель.Код, """") КАК ParentCode,
			|	ЕСТЬNULL(References.Родитель.Наименование, """") КАК ParentName,
			|	References.Родитель КАК Parent,
			|	Ложь КАК IsParent
			|ИЗ
			|	Справочник."+Reference+" КАК References
			|
			|УПОРЯДОЧИТЬ ПО
			|	Code ИЕРАРХИЯ";
		КонецЕсли;	
	КонецЕсли;
	
	
	ArrayOfReference = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://EtalonRefSyncEx", "ArrayOfReference"));
	
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	Если ВыборкаДетальныеЗаписи.Количество() > 0 Тогда
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ТекСтрока 			= ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://EtalonRefSyncEx", "Reference"));
			ЗаполнитьЗначенияСвойств(ТекСтрока,ВыборкаДетальныеЗаписи);
			
			ТекСтрока.GUID			= Строка(ВыборкаДетальныеЗаписи.Ссылка.УникальныйИдентификатор());
			ТекСтрока.ParentGUID	= Строка(ВыборкаДетальныеЗаписи.Parent.УникальныйИдентификатор());
			
			ArrayOfReference.Reference.Добавить(ТекСтрока);
		КонецЦикла;
	КонецЕсли;
	
	Возврат ArrayOfReference;
	
КонецФункции

Функция SetRequest(aDoc)
	НомеДок = aDoc.Number;
	НайденныйДокумент = Документы.ЗаявкаНаДобавлениеСправочника.НайтиПоНомеру(НомеДок);
	Если НайденныйДокумент = Документы.ЗаявкаНаДобавлениеСправочника.ПустаяСсылка() Тогда
		ТекДок = Документы.ЗаявкаНаДобавлениеСправочника.СоздатьДокумент();
	Иначе
		ТекДок = НайденныйДокумент.ПолучитьОбъект();
		
		Если ТекДок.Статус = "Завершена" или ТекДок.Статус = "Отказано" Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	
	ТекДок.Статус 			= "Создана";
	ТекДок.Номер 			= aDoc.Number;
	ТекДок.Дата  			= aDoc.Date;
	ТекДок.ТипСправочника 	= aDoc.RefType;
	ТекДок.Наименование		= aDoc.RefName;
	
	Если ЗначениеЗаполнено(aDoc.RefParentCode) Тогда
		ТекДок.Группа		= Справочники[aDoc.RefType].НайтиПоКоду(aDoc.RefParentCode);
	КонецЕсли;
	
	ТекДок.Ответственный 	= aDoc.UserName;
	ТекДок.КонтактныйТелефон= aDoc.UserPhone;
	ТекДок.ЭлектронныйАдрес	= aDoc.UserEMail;
	
	Попытка 
		ТекДок.Записать();
		Отказ = Истина;
	Исключение
		Отказ = Ложь;
	КонецПопытки;
	
	Возврат Отказ;
	
КонецФункции

Функция GetRequestResult(Number)
	
	НайденныйДокумент = Документы.ЗаявкаНаДобавлениеСправочника.НайтиПоНомеру(Number);
	Если НайденныйДокумент = Документы.ЗаявкаНаДобавлениеСправочника.ПустаяСсылка() Тогда
		Рез = "Не найдена заявка";
	Иначе
		ТекДок = НайденныйДокумент.ПолучитьОбъект();
		//если ТекДок.Статус <> "Создана" тогда
		Рез  = ТекДок.Статус;
		//КонецЕсли;
	КонецЕсли;
	
	Возврат Рез;
	
КонецФункции

Функция CheckBase(Base)
	  НайденнаяОрг = Справочники.Организации.ПустаяСсылка();
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	БазыОрганизации.Ссылка КАК Ссылка,
		               |	БазыОрганизации.Организация КАК Организация
		               |ИЗ
		               |	Справочник.Базы.Организации КАК БазыОрганизации
		               |ГДЕ
		               |	БазыОрганизации.Ссылка.Наименование = &ИмяБазы";
		
	Запрос.УстановитьПараметр("ИмяБазы",Base);
	РезОрг = запрос.Выполнить().Выбрать();
	если РезОрг.Следующий() Тогда
		НайденнаяОрг = РезОрг.Организация;
	КонецЕсли;	
	
	если НайденнаяОрг = Справочники.Организации.ПустаяСсылка() тогда
		возврат "Не найдена орг-ция по имени базы "+Строка(Base);
	Иначе
		возврат "ОК";
	КонецЕсли;	
КонецФункции
